var cityData3 =

    [
       
        {
            "id": "2",
            "value": "120000",
            "text": "天津市",
            "children": [
                {
                    "id": "3",
                    "value": "120100",
                    "text": "市辖区",
                    "father": "120000",
                    "children": [
                        {
                            "id": "19",
                            "value": "120101",
                            "text": "和平区",
                            "father": "120100"
                        },
                        {
                            "id": "20",
                            "value": "120102",
                            "text": "河东区",
                            "father": "120100"
                        },
                        {
                            "id": "21",
                            "value": "120103",
                            "text": "河西区",
                            "father": "120100"
                        },
                        {
                            "id": "22",
                            "value": "120104",
                            "text": "南开区",
                            "father": "120100"
                        },
                        {
                            "id": "23",
                            "value": "120105",
                            "text": "河北区",
                            "father": "120100"
                        },
                        {
                            "id": "24",
                            "value": "120106",
                            "text": "红桥区",
                            "father": "120100"
                        },
                        {
                            "id": "25",
                            "value": "120107",
                            "text": "塘沽区",
                            "father": "120100"
                        },
                        {
                            "id": "26",
                            "value": "120108",
                            "text": "汉沽区",
                            "father": "120100"
                        },
                        {
                            "id": "27",
                            "value": "120109",
                            "text": "大港区",
                            "father": "120100"
                        },
                        {
                            "id": "28",
                            "value": "120110",
                            "text": "东丽区",
                            "father": "120100"
                        },
                        {
                            "id": "29",
                            "value": "120111",
                            "text": "西青区",
                            "father": "120100"
                        },
                        {
                            "id": "30",
                            "value": "120112",
                            "text": "津南区",
                            "father": "120100"
                        },
                        {
                            "id": "31",
                            "value": "120113",
                            "text": "北辰区",
                            "father": "120100"
                        },
                        {
                            "id": "32",
                            "value": "120114",
                            "text": "武清区",
                            "father": "120100"
                        },
                        {
                            "id": "33",
                            "value": "120115",
                            "text": "宝坻区",
                            "father": "120100"
                        }
                    ]
                },
                {
                    "id": "4",
                    "value": "120200",
                    "text": "县",
                    "father": "120000",
                    "children": [
                        {
                            "id": "34",
                            "value": "120221",
                            "text": "宁河县",
                            "father": "120200"
                        },
                        {
                            "id": "35",
                            "value": "120223",
                            "text": "静海县",
                            "father": "120200"
                        },
                        {
                            "id": "36",
                            "value": "120225",
                            "text": "蓟　县",
                            "father": "120200"
                        }
                    ]
                }
            ]
        },
        {
            "id": "1",
            "value": "110000",
            "text": "北京市",
            "children": [
                {
                    "id": "1",
                    "value": "110100",
                    "text": "市辖区",
                    "father": "110000",
                    "children": [
                        {
                            "id": "1",
                            "value": "110101",
                            "text": "东城区",
                            "father": "110100"
                        },
                        {
                            "id": "2",
                            "value": "110102",
                            "text": "西城区",
                            "father": "110100"
                        },
                        {
                            "id": "3",
                            "value": "110103",
                            "text": "崇文区",
                            "father": "110100"
                        },
                        {
                            "id": "4",
                            "value": "110104",
                            "text": "宣武区",
                            "father": "110100"
                        },
                        {
                            "id": "5",
                            "value": "110105",
                            "text": "朝阳区",
                            "father": "110100"
                        },
                        {
                            "id": "6",
                            "value": "110106",
                            "text": "丰台区",
                            "father": "110100"
                        },
                        {
                            "id": "7",
                            "value": "110107",
                            "text": "石景山区",
                            "father": "110100"
                        },
                        {
                            "id": "8",
                            "value": "110108",
                            "text": "海淀区",
                            "father": "110100"
                        },
                        {
                            "id": "9",
                            "value": "110109",
                            "text": "门头沟区",
                            "father": "110100"
                        },
                        {
                            "id": "10",
                            "value": "110111",
                            "text": "房山区",
                            "father": "110100"
                        },
                        {
                            "id": "11",
                            "value": "110112",
                            "text": "通州区",
                            "father": "110100"
                        },
                        {
                            "id": "12",
                            "value": "110113",
                            "text": "顺义区",
                            "father": "110100"
                        },
                        {
                            "id": "13",
                            "value": "110114",
                            "text": "昌平区",
                            "father": "110100"
                        },
                        {
                            "id": "14",
                            "value": "110115",
                            "text": "大兴区",
                            "father": "110100"
                        },
                        {
                            "id": "15",
                            "value": "110116",
                            "text": "怀柔区",
                            "father": "110100"
                        },
                        {
                            "id": "16",
                            "value": "110117",
                            "text": "平谷区",
                            "father": "110100"
                        }
                    ]
                },
                {
                    "id": "2",
                    "value": "110200",
                    "text": "县",
                    "father": "110000",
                    "children": [
                        {
                            "id": "17",
                            "value": "110228",
                            "text": "密云县",
                            "father": "110200"
                        },
                        {
                            "id": "18",
                            "value": "110229",
                            "text": "延庆县",
                            "father": "110200"
                        }
                    ]
                }
            ]
        },
        {
            "id": "3",
            "value": "130000",
            "text": "河北省",
            "children": [
                {
                    "id": "5",
                    "value": "130100",
                    "text": "石家庄市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "37",
                            "value": "130101",
                            "text": "市辖区",
                            "father": "130100"
                        },
                        {
                            "id": "38",
                            "value": "130102",
                            "text": "长安区",
                            "father": "130100"
                        },
                        {
                            "id": "39",
                            "value": "130103",
                            "text": "桥东区",
                            "father": "130100"
                        },
                        {
                            "id": "40",
                            "value": "130104",
                            "text": "桥西区",
                            "father": "130100"
                        },
                        {
                            "id": "41",
                            "value": "130105",
                            "text": "新华区",
                            "father": "130100"
                        },
                        {
                            "id": "42",
                            "value": "130107",
                            "text": "井陉矿区",
                            "father": "130100"
                        },
                        {
                            "id": "43",
                            "value": "130108",
                            "text": "裕华区",
                            "father": "130100"
                        },
                        {
                            "id": "44",
                            "value": "130121",
                            "text": "井陉县",
                            "father": "130100"
                        },
                        {
                            "id": "45",
                            "value": "130123",
                            "text": "正定县",
                            "father": "130100"
                        },
                        {
                            "id": "46",
                            "value": "130124",
                            "text": "栾城县",
                            "father": "130100"
                        },
                        {
                            "id": "47",
                            "value": "130125",
                            "text": "行唐县",
                            "father": "130100"
                        },
                        {
                            "id": "48",
                            "value": "130126",
                            "text": "灵寿县",
                            "father": "130100"
                        },
                        {
                            "id": "49",
                            "value": "130127",
                            "text": "高邑县",
                            "father": "130100"
                        },
                        {
                            "id": "50",
                            "value": "130128",
                            "text": "深泽县",
                            "father": "130100"
                        },
                        {
                            "id": "51",
                            "value": "130129",
                            "text": "赞皇县",
                            "father": "130100"
                        },
                        {
                            "id": "52",
                            "value": "130130",
                            "text": "无极县",
                            "father": "130100"
                        },
                        {
                            "id": "53",
                            "value": "130131",
                            "text": "平山县",
                            "father": "130100"
                        },
                        {
                            "id": "54",
                            "value": "130132",
                            "text": "元氏县",
                            "father": "130100"
                        },
                        {
                            "id": "55",
                            "value": "130133",
                            "text": "赵　县",
                            "father": "130100"
                        },
                        {
                            "id": "56",
                            "value": "130181",
                            "text": "辛集市",
                            "father": "130100"
                        },
                        {
                            "id": "57",
                            "value": "130182",
                            "text": "藁城市",
                            "father": "130100"
                        },
                        {
                            "id": "58",
                            "value": "130183",
                            "text": "晋州市",
                            "father": "130100"
                        },
                        {
                            "id": "59",
                            "value": "130184",
                            "text": "新乐市",
                            "father": "130100"
                        },
                        {
                            "id": "60",
                            "value": "130185",
                            "text": "鹿泉市",
                            "father": "130100"
                        }
                    ]
                },
                {
                    "id": "6",
                    "value": "130200",
                    "text": "唐山市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "61",
                            "value": "130201",
                            "text": "市辖区",
                            "father": "130200"
                        },
                        {
                            "id": "62",
                            "value": "130202",
                            "text": "路南区",
                            "father": "130200"
                        },
                        {
                            "id": "63",
                            "value": "130203",
                            "text": "路北区",
                            "father": "130200"
                        },
                        {
                            "id": "64",
                            "value": "130204",
                            "text": "古冶区",
                            "father": "130200"
                        },
                        {
                            "id": "65",
                            "value": "130205",
                            "text": "开平区",
                            "father": "130200"
                        },
                        {
                            "id": "66",
                            "value": "130207",
                            "text": "丰南区",
                            "father": "130200"
                        },
                        {
                            "id": "67",
                            "value": "130208",
                            "text": "丰润区",
                            "father": "130200"
                        },
                        {
                            "id": "68",
                            "value": "130223",
                            "text": "滦　县",
                            "father": "130200"
                        },
                        {
                            "id": "69",
                            "value": "130224",
                            "text": "滦南县",
                            "father": "130200"
                        },
                        {
                            "id": "70",
                            "value": "130225",
                            "text": "乐亭县",
                            "father": "130200"
                        },
                        {
                            "id": "71",
                            "value": "130227",
                            "text": "迁西县",
                            "father": "130200"
                        },
                        {
                            "id": "72",
                            "value": "130229",
                            "text": "玉田县",
                            "father": "130200"
                        },
                        {
                            "id": "73",
                            "value": "130230",
                            "text": "唐海县",
                            "father": "130200"
                        },
                        {
                            "id": "74",
                            "value": "130281",
                            "text": "遵化市",
                            "father": "130200"
                        },
                        {
                            "id": "75",
                            "value": "130283",
                            "text": "迁安市",
                            "father": "130200"
                        }
                    ]
                },
                {
                    "id": "7",
                    "value": "130300",
                    "text": "秦皇岛市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "76",
                            "value": "130301",
                            "text": "市辖区",
                            "father": "130300"
                        },
                        {
                            "id": "77",
                            "value": "130302",
                            "text": "海港区",
                            "father": "130300"
                        },
                        {
                            "id": "78",
                            "value": "130303",
                            "text": "山海关区",
                            "father": "130300"
                        },
                        {
                            "id": "79",
                            "value": "130304",
                            "text": "北戴河区",
                            "father": "130300"
                        },
                        {
                            "id": "80",
                            "value": "130321",
                            "text": "青龙满族自治县",
                            "father": "130300"
                        },
                        {
                            "id": "81",
                            "value": "130322",
                            "text": "昌黎县",
                            "father": "130300"
                        },
                        {
                            "id": "82",
                            "value": "130323",
                            "text": "抚宁县",
                            "father": "130300"
                        },
                        {
                            "id": "83",
                            "value": "130324",
                            "text": "卢龙县",
                            "father": "130300"
                        }
                    ]
                },
                {
                    "id": "8",
                    "value": "130400",
                    "text": "邯郸市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "84",
                            "value": "130401",
                            "text": "市辖区",
                            "father": "130400"
                        },
                        {
                            "id": "85",
                            "value": "130402",
                            "text": "邯山区",
                            "father": "130400"
                        },
                        {
                            "id": "86",
                            "value": "130403",
                            "text": "丛台区",
                            "father": "130400"
                        },
                        {
                            "id": "87",
                            "value": "130404",
                            "text": "复兴区",
                            "father": "130400"
                        },
                        {
                            "id": "88",
                            "value": "130406",
                            "text": "峰峰矿区",
                            "father": "130400"
                        },
                        {
                            "id": "89",
                            "value": "130421",
                            "text": "邯郸县",
                            "father": "130400"
                        },
                        {
                            "id": "90",
                            "value": "130423",
                            "text": "临漳县",
                            "father": "130400"
                        },
                        {
                            "id": "91",
                            "value": "130424",
                            "text": "成安县",
                            "father": "130400"
                        },
                        {
                            "id": "92",
                            "value": "130425",
                            "text": "大名县",
                            "father": "130400"
                        },
                        {
                            "id": "93",
                            "value": "130426",
                            "text": "涉　县",
                            "father": "130400"
                        },
                        {
                            "id": "94",
                            "value": "130427",
                            "text": "磁　县",
                            "father": "130400"
                        },
                        {
                            "id": "95",
                            "value": "130428",
                            "text": "肥乡县",
                            "father": "130400"
                        },
                        {
                            "id": "96",
                            "value": "130429",
                            "text": "永年县",
                            "father": "130400"
                        },
                        {
                            "id": "97",
                            "value": "130430",
                            "text": "邱　县",
                            "father": "130400"
                        },
                        {
                            "id": "98",
                            "value": "130431",
                            "text": "鸡泽县",
                            "father": "130400"
                        },
                        {
                            "id": "99",
                            "value": "130432",
                            "text": "广平县",
                            "father": "130400"
                        },
                        {
                            "id": "100",
                            "value": "130433",
                            "text": "馆陶县",
                            "father": "130400"
                        },
                        {
                            "id": "101",
                            "value": "130434",
                            "text": "魏　县",
                            "father": "130400"
                        },
                        {
                            "id": "102",
                            "value": "130435",
                            "text": "曲周县",
                            "father": "130400"
                        },
                        {
                            "id": "103",
                            "value": "130481",
                            "text": "武安市",
                            "father": "130400"
                        }
                    ]
                },
                {
                    "id": "9",
                    "value": "130500",
                    "text": "邢台市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "104",
                            "value": "130501",
                            "text": "市辖区",
                            "father": "130500"
                        },
                        {
                            "id": "105",
                            "value": "130502",
                            "text": "桥东区",
                            "father": "130500"
                        },
                        {
                            "id": "106",
                            "value": "130503",
                            "text": "桥西区",
                            "father": "130500"
                        },
                        {
                            "id": "107",
                            "value": "130521",
                            "text": "邢台县",
                            "father": "130500"
                        },
                        {
                            "id": "108",
                            "value": "130522",
                            "text": "临城县",
                            "father": "130500"
                        },
                        {
                            "id": "109",
                            "value": "130523",
                            "text": "内丘县",
                            "father": "130500"
                        },
                        {
                            "id": "110",
                            "value": "130524",
                            "text": "柏乡县",
                            "father": "130500"
                        },
                        {
                            "id": "111",
                            "value": "130525",
                            "text": "隆尧县",
                            "father": "130500"
                        },
                        {
                            "id": "112",
                            "value": "130526",
                            "text": "任　县",
                            "father": "130500"
                        },
                        {
                            "id": "113",
                            "value": "130527",
                            "text": "南和县",
                            "father": "130500"
                        },
                        {
                            "id": "114",
                            "value": "130528",
                            "text": "宁晋县",
                            "father": "130500"
                        },
                        {
                            "id": "115",
                            "value": "130529",
                            "text": "巨鹿县",
                            "father": "130500"
                        },
                        {
                            "id": "116",
                            "value": "130530",
                            "text": "新河县",
                            "father": "130500"
                        },
                        {
                            "id": "117",
                            "value": "130531",
                            "text": "广宗县",
                            "father": "130500"
                        },
                        {
                            "id": "118",
                            "value": "130532",
                            "text": "平乡县",
                            "father": "130500"
                        },
                        {
                            "id": "119",
                            "value": "130533",
                            "text": "威　县",
                            "father": "130500"
                        },
                        {
                            "id": "120",
                            "value": "130534",
                            "text": "清河县",
                            "father": "130500"
                        },
                        {
                            "id": "121",
                            "value": "130535",
                            "text": "临西县",
                            "father": "130500"
                        },
                        {
                            "id": "122",
                            "value": "130581",
                            "text": "南宫市",
                            "father": "130500"
                        },
                        {
                            "id": "123",
                            "value": "130582",
                            "text": "沙河市",
                            "father": "130500"
                        }
                    ]
                },
                {
                    "id": "10",
                    "value": "130600",
                    "text": "保定市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "124",
                            "value": "130601",
                            "text": "市辖区",
                            "father": "130600"
                        },
                        {
                            "id": "125",
                            "value": "130602",
                            "text": "新市区",
                            "father": "130600"
                        },
                        {
                            "id": "126",
                            "value": "130603",
                            "text": "北市区",
                            "father": "130600"
                        },
                        {
                            "id": "127",
                            "value": "130604",
                            "text": "南市区",
                            "father": "130600"
                        },
                        {
                            "id": "128",
                            "value": "130621",
                            "text": "满城县",
                            "father": "130600"
                        },
                        {
                            "id": "129",
                            "value": "130622",
                            "text": "清苑县",
                            "father": "130600"
                        },
                        {
                            "id": "130",
                            "value": "130623",
                            "text": "涞水县",
                            "father": "130600"
                        },
                        {
                            "id": "131",
                            "value": "130624",
                            "text": "阜平县",
                            "father": "130600"
                        },
                        {
                            "id": "132",
                            "value": "130625",
                            "text": "徐水县",
                            "father": "130600"
                        },
                        {
                            "id": "133",
                            "value": "130626",
                            "text": "定兴县",
                            "father": "130600"
                        },
                        {
                            "id": "134",
                            "value": "130627",
                            "text": "唐　县",
                            "father": "130600"
                        },
                        {
                            "id": "135",
                            "value": "130628",
                            "text": "高阳县",
                            "father": "130600"
                        },
                        {
                            "id": "136",
                            "value": "130629",
                            "text": "容城县",
                            "father": "130600"
                        },
                        {
                            "id": "137",
                            "value": "130630",
                            "text": "涞源县",
                            "father": "130600"
                        },
                        {
                            "id": "138",
                            "value": "130631",
                            "text": "望都县",
                            "father": "130600"
                        },
                        {
                            "id": "139",
                            "value": "130632",
                            "text": "安新县",
                            "father": "130600"
                        },
                        {
                            "id": "140",
                            "value": "130633",
                            "text": "易　县",
                            "father": "130600"
                        },
                        {
                            "id": "141",
                            "value": "130634",
                            "text": "曲阳县",
                            "father": "130600"
                        },
                        {
                            "id": "142",
                            "value": "130635",
                            "text": "蠡　县",
                            "father": "130600"
                        },
                        {
                            "id": "143",
                            "value": "130636",
                            "text": "顺平县",
                            "father": "130600"
                        },
                        {
                            "id": "144",
                            "value": "130637",
                            "text": "博野县",
                            "father": "130600"
                        },
                        {
                            "id": "145",
                            "value": "130638",
                            "text": "雄　县",
                            "father": "130600"
                        },
                        {
                            "id": "146",
                            "value": "130681",
                            "text": "涿州市",
                            "father": "130600"
                        },
                        {
                            "id": "147",
                            "value": "130682",
                            "text": "定州市",
                            "father": "130600"
                        },
                        {
                            "id": "148",
                            "value": "130683",
                            "text": "安国市",
                            "father": "130600"
                        },
                        {
                            "id": "149",
                            "value": "130684",
                            "text": "高碑店市",
                            "father": "130600"
                        }
                    ]
                },
                {
                    "id": "11",
                    "value": "130700",
                    "text": "张家口市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "150",
                            "value": "130701",
                            "text": "市辖区",
                            "father": "130700"
                        },
                        {
                            "id": "151",
                            "value": "130702",
                            "text": "桥东区",
                            "father": "130700"
                        },
                        {
                            "id": "152",
                            "value": "130703",
                            "text": "桥西区",
                            "father": "130700"
                        },
                        {
                            "id": "153",
                            "value": "130705",
                            "text": "宣化区",
                            "father": "130700"
                        },
                        {
                            "id": "154",
                            "value": "130706",
                            "text": "下花园区",
                            "father": "130700"
                        },
                        {
                            "id": "155",
                            "value": "130721",
                            "text": "宣化县",
                            "father": "130700"
                        },
                        {
                            "id": "156",
                            "value": "130722",
                            "text": "张北县",
                            "father": "130700"
                        },
                        {
                            "id": "157",
                            "value": "130723",
                            "text": "康保县",
                            "father": "130700"
                        },
                        {
                            "id": "158",
                            "value": "130724",
                            "text": "沽源县",
                            "father": "130700"
                        },
                        {
                            "id": "159",
                            "value": "130725",
                            "text": "尚义县",
                            "father": "130700"
                        },
                        {
                            "id": "160",
                            "value": "130726",
                            "text": "蔚　县",
                            "father": "130700"
                        },
                        {
                            "id": "161",
                            "value": "130727",
                            "text": "阳原县",
                            "father": "130700"
                        },
                        {
                            "id": "162",
                            "value": "130728",
                            "text": "怀安县",
                            "father": "130700"
                        },
                        {
                            "id": "163",
                            "value": "130729",
                            "text": "万全县",
                            "father": "130700"
                        },
                        {
                            "id": "164",
                            "value": "130730",
                            "text": "怀来县",
                            "father": "130700"
                        },
                        {
                            "id": "165",
                            "value": "130731",
                            "text": "涿鹿县",
                            "father": "130700"
                        },
                        {
                            "id": "166",
                            "value": "130732",
                            "text": "赤城县",
                            "father": "130700"
                        },
                        {
                            "id": "167",
                            "value": "130733",
                            "text": "崇礼县",
                            "father": "130700"
                        }
                    ]
                },
                {
                    "id": "12",
                    "value": "130800",
                    "text": "承德市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "168",
                            "value": "130801",
                            "text": "市辖区",
                            "father": "130800"
                        },
                        {
                            "id": "169",
                            "value": "130802",
                            "text": "双桥区",
                            "father": "130800"
                        },
                        {
                            "id": "170",
                            "value": "130803",
                            "text": "双滦区",
                            "father": "130800"
                        },
                        {
                            "id": "171",
                            "value": "130804",
                            "text": "鹰手营子矿区",
                            "father": "130800"
                        },
                        {
                            "id": "172",
                            "value": "130821",
                            "text": "承德县",
                            "father": "130800"
                        },
                        {
                            "id": "173",
                            "value": "130822",
                            "text": "兴隆县",
                            "father": "130800"
                        },
                        {
                            "id": "174",
                            "value": "130823",
                            "text": "平泉县",
                            "father": "130800"
                        },
                        {
                            "id": "175",
                            "value": "130824",
                            "text": "滦平县",
                            "father": "130800"
                        },
                        {
                            "id": "176",
                            "value": "130825",
                            "text": "隆化县",
                            "father": "130800"
                        },
                        {
                            "id": "177",
                            "value": "130826",
                            "text": "丰宁满族自治县",
                            "father": "130800"
                        },
                        {
                            "id": "178",
                            "value": "130827",
                            "text": "宽城满族自治县",
                            "father": "130800"
                        },
                        {
                            "id": "179",
                            "value": "130828",
                            "text": "围场满族蒙古族自治县",
                            "father": "130800"
                        }
                    ]
                },
                {
                    "id": "13",
                    "value": "130900",
                    "text": "沧州市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "180",
                            "value": "130901",
                            "text": "市辖区",
                            "father": "130900"
                        },
                        {
                            "id": "181",
                            "value": "130902",
                            "text": "新华区",
                            "father": "130900"
                        },
                        {
                            "id": "182",
                            "value": "130903",
                            "text": "运河区",
                            "father": "130900"
                        },
                        {
                            "id": "183",
                            "value": "130921",
                            "text": "沧　县",
                            "father": "130900"
                        },
                        {
                            "id": "184",
                            "value": "130922",
                            "text": "青　县",
                            "father": "130900"
                        },
                        {
                            "id": "185",
                            "value": "130923",
                            "text": "东光县",
                            "father": "130900"
                        },
                        {
                            "id": "186",
                            "value": "130924",
                            "text": "海兴县",
                            "father": "130900"
                        },
                        {
                            "id": "187",
                            "value": "130925",
                            "text": "盐山县",
                            "father": "130900"
                        },
                        {
                            "id": "188",
                            "value": "130926",
                            "text": "肃宁县",
                            "father": "130900"
                        },
                        {
                            "id": "189",
                            "value": "130927",
                            "text": "南皮县",
                            "father": "130900"
                        },
                        {
                            "id": "190",
                            "value": "130928",
                            "text": "吴桥县",
                            "father": "130900"
                        },
                        {
                            "id": "191",
                            "value": "130929",
                            "text": "献　县",
                            "father": "130900"
                        },
                        {
                            "id": "192",
                            "value": "130930",
                            "text": "孟村回族自治县",
                            "father": "130900"
                        },
                        {
                            "id": "193",
                            "value": "130981",
                            "text": "泊头市",
                            "father": "130900"
                        },
                        {
                            "id": "194",
                            "value": "130982",
                            "text": "任丘市",
                            "father": "130900"
                        },
                        {
                            "id": "195",
                            "value": "130983",
                            "text": "黄骅市",
                            "father": "130900"
                        },
                        {
                            "id": "196",
                            "value": "130984",
                            "text": "河间市",
                            "father": "130900"
                        }
                    ]
                },
                {
                    "id": "14",
                    "value": "131000",
                    "text": "廊坊市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "197",
                            "value": "131001",
                            "text": "市辖区",
                            "father": "131000"
                        },
                        {
                            "id": "198",
                            "value": "131002",
                            "text": "安次区",
                            "father": "131000"
                        },
                        {
                            "id": "199",
                            "value": "131003",
                            "text": "广阳区",
                            "father": "131000"
                        },
                        {
                            "id": "200",
                            "value": "131022",
                            "text": "固安县",
                            "father": "131000"
                        },
                        {
                            "id": "201",
                            "value": "131023",
                            "text": "永清县",
                            "father": "131000"
                        },
                        {
                            "id": "202",
                            "value": "131024",
                            "text": "香河县",
                            "father": "131000"
                        },
                        {
                            "id": "203",
                            "value": "131025",
                            "text": "大城县",
                            "father": "131000"
                        },
                        {
                            "id": "204",
                            "value": "131026",
                            "text": "文安县",
                            "father": "131000"
                        },
                        {
                            "id": "205",
                            "value": "131028",
                            "text": "大厂回族自治县",
                            "father": "131000"
                        },
                        {
                            "id": "206",
                            "value": "131081",
                            "text": "霸州市",
                            "father": "131000"
                        },
                        {
                            "id": "207",
                            "value": "131082",
                            "text": "三河市",
                            "father": "131000"
                        }
                    ]
                },
                {
                    "id": "15",
                    "value": "131100",
                    "text": "衡水市",
                    "father": "130000",
                    "children": [
                        {
                            "id": "208",
                            "value": "131101",
                            "text": "市辖区",
                            "father": "131100"
                        },
                        {
                            "id": "209",
                            "value": "131102",
                            "text": "桃城区",
                            "father": "131100"
                        },
                        {
                            "id": "210",
                            "value": "131121",
                            "text": "枣强县",
                            "father": "131100"
                        },
                        {
                            "id": "211",
                            "value": "131122",
                            "text": "武邑县",
                            "father": "131100"
                        },
                        {
                            "id": "212",
                            "value": "131123",
                            "text": "武强县",
                            "father": "131100"
                        },
                        {
                            "id": "213",
                            "value": "131124",
                            "text": "饶阳县",
                            "father": "131100"
                        },
                        {
                            "id": "214",
                            "value": "131125",
                            "text": "安平县",
                            "father": "131100"
                        },
                        {
                            "id": "215",
                            "value": "131126",
                            "text": "故城县",
                            "father": "131100"
                        },
                        {
                            "id": "216",
                            "value": "131127",
                            "text": "景　县",
                            "father": "131100"
                        },
                        {
                            "id": "217",
                            "value": "131128",
                            "text": "阜城县",
                            "father": "131100"
                        },
                        {
                            "id": "218",
                            "value": "131181",
                            "text": "冀州市",
                            "father": "131100"
                        },
                        {
                            "id": "219",
                            "value": "131182",
                            "text": "深州市",
                            "father": "131100"
                        }
                    ]
                }
            ]
        },

    ]
